In [1]:
import pandas as pd

En este archivo lo que hacemos es cargar los archivos de taxi_yellow 2023 y concatenarlos. Antes de realizar la concatenacion, se toma una muestra de cada dataset y se realiza la concatenacion apartir de las muestras. Esto debido a que cada dataset tiene muchisimas filas (+3 millones).

In [7]:
yellow_1 = pd.read_parquet('../Data/TLC_scraping/yellow_tripdata_2023-01.parquet')
yellow_2 = pd.read_parquet('../Data/TLC_scraping/yellow_tripdata_2023-02.parquet')
yellow_3 = pd.read_parquet('../Data/TLC_scraping/yellow_tripdata_2023-03.parquet')
yellow_4 = pd.read_parquet('../Data/TLC_scraping/yellow_tripdata_2023-04.parquet')
yellow_5 = pd.read_parquet('../Data/TLC_scraping/yellow_tripdata_2023-05.parquet')
yellow_6 = pd.read_parquet('../Data/TLC_scraping/yellow_tripdata_2023-06.parquet')
yellow_7 = pd.read_parquet('../Data/TLC_scraping/yellow_tripdata_2023-07.parquet')
yellow_8 = pd.read_parquet('../Data/TLC_scraping/yellow_tripdata_2023-08.parquet')
yellow_9 = pd.read_parquet('../Data/TLC_scraping/yellow_tripdata_2023-09.parquet')
yellow_10 = pd.read_parquet('../Data/TLC_scraping/yellow_tripdata_2023-10.parquet')
yellow_11 = pd.read_parquet('../Data/TLC_scraping/yellow_tripdata_2023-11.parquet')
yellow_12 = pd.read_parquet('../Data/TLC_scraping/yellow_tripdata_2023-12.parquet')

In [8]:
yellow_1.shape

(3066766, 19)

In [9]:
# Lista de nombres de los DataFrames
nombres_dataframes = ['yellow_1', 'yellow_2', 'yellow_3', 'yellow_4', 'yellow_5', 
                      'yellow_6', 'yellow_7', 'yellow_8', 'yellow_9', 'yellow_10', 
                      'yellow_11', 'yellow_12']

# Definir las columnas importantes
columnas_importantes = ['PULocationID', 'tpep_pickup_datetime', 'tpep_dropoff_datetime', 'passenger_count', 'trip_distance', 'total_amount']

# Itera sobre los nombres de los DataFrames y seleccionar las columnas importantes
for nombre_df in nombres_dataframes:
    df = globals()[nombre_df]  # Obtiene el DataFrame por su nombre
    globals()[nombre_df] = df.loc[:, columnas_importantes]  # Selecciona las columnas importantes y reasigna al DataFrame original

In [10]:
# Toma una muestra aleatoria del dataframe pasado por parametro
def tomar_muestra(df_nombre):
   
    # Carga el DataFrame especificado
    df = globals()[df_nombre]
    
    num_filas_muestra = int(len(df) * 3 / 100)  # Calcula el n√∫mero de filas de la muestra
    muestra = df.sample(n=num_filas_muestra, random_state=42)  # Toma una muestra aleatoria del DataFrame
    return muestra

In [11]:
#Invoco la funcion en cada Dataframe
taxisyellow1 = tomar_muestra('yellow_1')
taxisyellow2 = tomar_muestra('yellow_2')
taxisyellow3 = tomar_muestra('yellow_3')
taxisyellow4 = tomar_muestra('yellow_4')
taxisyellow5 = tomar_muestra('yellow_5')
taxisyellow6 = tomar_muestra('yellow_6')
taxisyellow7 = tomar_muestra('yellow_7')
taxisyellow8 = tomar_muestra('yellow_8')
taxisyellow9 = tomar_muestra('yellow_9')
taxisyellow10 = tomar_muestra('yellow_10')
taxisyellow11 = tomar_muestra('yellow_11')
taxisyellow12 = tomar_muestra('yellow_12')

In [12]:
#Concateno las 12 muestras.
dataframes = [taxisyellow1, taxisyellow2, taxisyellow3, taxisyellow4, taxisyellow5, taxisyellow6,
              taxisyellow7, taxisyellow8, taxisyellow9, taxisyellow10, taxisyellow11, taxisyellow12]
df_concatenado = pd.concat(dataframes, ignore_index=True)

In [13]:
df_concatenado.shape

(1149301, 6)

In [14]:
df_concatenado.head()

,PULocationID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,total_amount
0,262,2023-01-29 17:52:02,2023-01-29 17:56:43,1.0,1.17,11.20
1,229,2023-01-08 15:57:24,2023-01-08 16:02:47,1.0,0.90,10.50
2,45,2023-01-21 19:38:01,2023-01-21 19:45:02,1.0,0.95,14.28
3,237,2023-01-23 16:07:31,2023-01-23 16:26:46,5.0,0.88,24.30
4,229,2023-01-26 21:21:08,2023-01-26 21:24:48,2.0,1.03,13.80

--------------------

In [16]:
zonas_taxi = pd.read_parquet('../Data/Normalized/taxi_zones.parquet')
zonas_taxi

                        Zone  LocationID        Borough
0             Newark Airport           1            EWR
1                Jamaica Bay           2         Queens
2    Allerton/Pelham Gardens           3          Bronx
3              Alphabet City           4      Manhattan
4              Arden Heights           5  Staten Island
..                       ...         ...            ...
255       Woodlawn/Wakefield         259          Bronx
256                 Woodside         260         Queens
257       World Trade Center         261      Manhattan
258           Yorkville East         262      Manhattan
259           Yorkville West         263      Manhattan

[260 rows x 3 columns]

In [17]:
zonas_taxi['Borough'].unique()

array(['EWR', 'Queens', 'Bronx', 'Manhattan', 'Staten Island', 'Brooklyn'],
      dtype=object)

In [18]:
# Filtra los datos para el barrio de Manhattan y obtener las ubicaciones √∫nicas de taxi
manhattan = zonas_taxi.loc[zonas_taxi['Borough'] == 'Manhattan', 'LocationID'].unique()
manhattan

array([  4,  12,  13,  24,  41,  42,  43,  45,  48,  50,  68,  74,  75,
        79,  87,  88,  90, 100, 103, 107, 113, 114, 116, 120, 125, 127,
       128, 137, 140, 141, 142, 143, 144, 148, 151, 152, 153, 158, 161,
       162, 163, 164, 166, 170, 186, 194, 202, 209, 211, 224, 229, 230,
       231, 232, 233, 234, 236, 237, 238, 239, 243, 244, 246, 249, 261,
       262, 263], dtype=int64)

In [19]:
queens = zonas_taxi.loc[zonas_taxi['Borough'] == 'Queens', 'LocationID'].unique()
queens

array([  2,   7,   8,   9,  10,  15,  16,  19,  27,  28,  30,  38,  53,
        56,  64,  70,  73,  82,  83,  86,  92,  93,  95,  96,  98, 101,
       102, 117, 121, 122, 124, 129, 130, 131, 132, 134, 135, 138, 139,
       145, 146, 157, 160, 171, 173, 175, 179, 180, 191, 192, 193, 196,
       197, 198, 201, 203, 205, 207, 215, 216, 218, 219, 223, 226, 252,
       253, 258, 260], dtype=int64)

In [20]:
staten_isl = zonas_taxi.loc[zonas_taxi['Borough'] == 'Staten Island', 'LocationID'].unique()
staten_isl

array([  5,   6,  23,  44,  84,  99, 109, 110, 115, 118, 156, 172, 176,
       187, 204, 206, 214, 221, 245, 251], dtype=int64)

In [21]:
brooklyn = zonas_taxi.loc[zonas_taxi['Borough'] == 'Brooklyn', 'LocationID'].unique()
brooklyn

array([ 11,  14,  17,  21,  22,  25,  26,  29,  33,  34,  35,  36,  37,
        39,  40,  49,  52,  54,  55,  61,  62,  63,  65,  66,  67,  71,
        72,  76,  77,  80,  85,  89,  91,  97, 106, 108, 111, 112, 123,
       133, 149, 150, 154, 155, 165, 177, 178, 181, 188, 189, 190, 195,
       210, 217, 222, 225, 227, 228, 255, 256, 257], dtype=int64)

In [22]:
ewr = zonas_taxi.loc[zonas_taxi['Borough'] == 'EWR', 'LocationID'].unique()
ewr

array([1], dtype=int64)

In [23]:
def obtener_distrito(locationId):
    # Diccionario con ID de distritos
    zonas = {
        'Manhattan': [4,  12,  13,  24,  41,  42,  43,  45,  48,  50,  68,  74,  75,
                      79,  87,  88,  90, 100, 103, 107, 113, 114, 116, 120, 125, 127,
                      128, 137, 140, 141, 142, 143, 144, 148, 151, 152, 153, 158, 161,
                      162, 163, 164, 166, 170, 186, 194, 202, 209, 211, 224, 229, 230,
                      231, 232, 233, 234, 236, 237, 238, 239, 243, 244, 246, 249, 261,
                      262, 263],
        
        'Brooklyn': [11,  14,  17,  21,  22,  25,  26,  29,  33,  34,  35,  36,  37,
                     39,  40,  49,  52,  54,  55,  61,  62,  63,  65,  66,  67,  71,
                     72,  76,  77,  80,  85,  89,  91,  97, 106, 108, 111, 112, 123,
                     133, 149, 150, 154, 155, 165, 177, 178, 181, 188, 189, 190, 195,
                     210, 217, 222, 225, 227, 228, 255, 256, 257],
        
        'Queens': [2,   7,   8,   9,  10,  15,  16,  19,  27,  28,  30,  38,  53,
                   56,  64,  70,  73,  82,  83,  86,  92,  93,  95,  96,  98, 101,
                   102, 117, 121, 122, 124, 129, 130, 131, 132, 134, 135, 138, 139,
                   145, 146, 157, 160, 171, 173, 175, 179, 180, 191, 192, 193, 196,
                   197, 198, 201, 203, 205, 207, 215, 216, 218, 219, 223, 226, 252,
                   253, 258, 260],
        
        'Staten Island': [5,   6,  23,  44,  84,  99, 109, 110, 115, 118, 156, 172, 176,
                          187, 204, 206, 214, 221, 245, 251],
        
        'EWR':[1]
    }
    #    Clave  valor
    for distrito, ids in zonas.items():
        if locationId in ids: #Si el ID pasado como argumento esta en la lista
            return distrito   # retorna la clave del diccionario (distrito)
        
    return 'SD'

In [24]:
df_concatenado['Pickup_borough'] = df_concatenado['PULocationID'].apply(obtener_distrito)
df_concatenado['Servicio'] = 'Yellow'

In [26]:
df_concatenado.drop(['PULocationID'],axis=1,inplace=True)

In [27]:
df_concatenado.head()

,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,total_amount,Pickup_borough,Servicio
0,2023-01-29 17:52:02,2023-01-29 17:56:43,1.0,1.17,11.20,Manhattan,Yellow
1,2023-01-08 15:57:24,2023-01-08 16:02:47,1.0,0.90,10.50,Manhattan,Yellow
2,2023-01-21 19:38:01,2023-01-21 19:45:02,1.0,0.95,14.28,Manhattan,Yellow
3,2023-01-23 16:07:31,2023-01-23 16:26:46,5.0,0.88,24.30,Manhattan,Yellow
4,2023-01-26 21:21:08,2023-01-26 21:24:48,2.0,1.03,13.80,Manhattan,Yellow

In [30]:
df_concatenado = df_concatenado[df_concatenado['Pickup_borough'] != 'SD']

In [32]:
df_concatenado.to_parquet('../Data/Normalized/taxis_yellow.parquet',index=False)